import numpy as np
a = np.array([[0, 12, 999, 999, 999, 16, 14], 
			  [12, 0, 10,  999, 999, 7, 999],
			  [999,10, 0,  3,   5,   6, 999],
			  [999,999,3,  0,   4,  999,999],
			  [999,999,5,  4,   0,   2, 8],
			  [16, 7,  6, 999,  2,   0, 9],
			  [14, 999,999,999, 8,   9, 0]])
n=7
# 使用Floyd算法
for k in range(0, n):
	for i in range(0, n):
		for j in range(0, n):
			if a[i][k] + a[k][j] < a[i][j]:
				a[i][j] = a[i][k] + a[k][j]

# 输出结果
print('各城市之间的最短距离：', a)
print('城市D到其他城市的最短距离：', a[3])
